
# 집합 데이터 출력

print("문자열:", '홍길동')
print("문자열:", "홍길동")
print("문자열:", '''홍길동''')
print("문자열:", """홍길동""")

print("리스트:", [10,20,30,20,10] )
print("리스트:", ["홍길동","이순신","홍길동"] )
print("리스트:", ["홍길동",20, True] ) # 많이 사용되는 경우 아님.


print("튜플:", (10,20,30,20,10) )
print("튜플:", ("홍길동","이순신","홍길동") )
print("튜플:", ("홍길동",20, True) )
print("튜플:", (20,) ) # 하나의 값을 가진 tuple 표현식

print("셋:", {10, 20, 30, 20, 10} )

print("딕셔너리:", {"name":"홍길동","age":20, "phone":["010","011"]} )

print([10,"a",True, None, [1,2,3],(2,3,),{44,2,2,4},{"name":"홍길동","age":20, "phone":["010","011"]}])


